# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple
backbone1depth: 2  # layer channel multiple
anchors: 4
#  - [3,2,  3,2,  4,3]  # P3/8
#  - [5,3,  6,4,  7,5]  # P4/16
#  - [9,5,  11,6,  15,8]  # P5/32

#  - [ 7,7,  10,7,  10,9 ]  # P3/8
#  - [ 14,8,  12,11,  16,11 ]  # P4/16
#  - [ 15,14,  22,11,  26,15 ]  # P5/32

#  - [3,6, 8,14, 18,26]  #4

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  #0 -P1/2
   [-1, 3, C3, [8]], #1 640*640*8
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  #2 0-P1/2
   [-1, 3, C3, [8]], #3 640*640*8
   [[-1, 1], 1, Concat3, [16,1]],  #4 640*640*16
   [-1, 3, C3, [32]], #5 640*640*32

   [-1, 1, Conv, [64, 3, 2]],  #6 320*320*64
   [-1, 3, C3, [64]], #7 320*320*64

   [-1, 1, Conv, [128, 3, 2]], #8 160*160*128
   [-1, 3, C3, [128]], #9 160*160*128

   [-1, 1, Conv, [256, 3, 2]], #10 80*80*256
   [-1, 9, C3, [256]], #11 80*80*256
   [-1, 1, SPPF, [256, 5]],  #12 80*80*256
  ]

# YOLOv5 v6.0 head
head:
# neck
  [[-1, 1, Conv, [128, 1, 1]], #13 80*80*128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #14 160*160*128
   [[-1, 9], 1, Concat, [1]],  #15 cat backbone P4 160*160*256

   [-1, 3, C3, [128, False]],  # 16 160*160*128
   [-1, 1, Conv, [64, 1, 1]],  #17 160*160*64
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #18 320*320*64
   [[-1, 7], 1, Concat, [1]],  #19 cat backbone P3 320*320*64

   [-1, 3, C3, [64, False]],  # 20 320*320*64
   [-1, 1, Conv, [32, 1, 1]],  #21 320*320*32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #22 640*640*32
   [[-1, 5], 1, Concat, [1]],  #23 cat backbone P2 640*640*64

# head
   [-1, 3, C3, [32, False]],  # 24 640*640*32
   [ -1, 1, Conv, [32, 3, 2]],  # 25 320*320*32
   [ [ -1, 21], 1, Concat, [1]],  # 26 cat head P4 320*320*64

   [ -1, 3, C3, [64, False]],  # 27 320*320*64
   [-1, 1, Conv, [64, 3, 2]], #28 160*160*64
   [[-1, 17], 1, Concat, [1]],  #39 cat head P5 160*160*128

   [-1, 3, C3, [128, False]],  #30 (P5/32-large) 160*160*128
   [-1, 1, Conv, [128, 3, 2]], #31 80*80*128
   [[-1, 13], 1, Concat, [1]],  #32 cat head P5 80*80*256
   [ -1, 3, C3, [256, False]] ,  #33 (P5/32-large) 80*80*256

   [[26, 27, 30, 33], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
