# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple
backbone1depth: 2  # layer channel multiple
anchors:
#  - [3,2,  3,2,  4,3]  # P3/8
#  - [5,3,  6,4,  7,5]  # P4/16
#  - [9,5,  11,6,  15,8]  # P5/32

  - [ 3,2,  4,3,  4,3 ]  # P3/8
  - [ 6,4,  7,5,  9,6 ]  # P4/16
  - [ 12,7,  15,9,  26,14 ]  # P5/32

#  - [3,6, 8,14, 18,26]  #4

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  # 0-P1/2
   #640*640*3
   [-1, 3, C3, [8]],]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  #2 0-P1/2
   [-1, 3, C3, [8]], #
   [[-1, 1], 1, Concat3, [16,1]],  #640*640*16
   [-1, 3, C3, [32]], #

   [-1, 1, Conv, [64, 3, 2]],  #320*320*64
   [-1, 3, C3, [64]], #

   [-1, 1, Conv, [128, 3, 2]], 
   [-1, 3, C3, [128]], #9 160*160*128

   [-1, 1, Conv, [256, 3, 2]], # 80*80*256
   [-1, 9, C3, [256]], #80*80*256
   [-1, 1, SPPF, [256, 5]],  #12 #80*80*128
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #20×20×256
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #40×40×256
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4 #40×40×512
   [-1, 3, C3, [512, False]],  # 16 #40×40×256

   [-1, 1, Conv, [256, 1, 1]], #40×40×128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #80×80×128
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3 #80×80×256
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small) #80×80×128

   [-1, 1, Conv, [256, 3, 2]], #40×40×256
   [[-1, 16], 1, Concat, [1]],  # cat head P4 #40×40×512
   [-1, 3, C3, [512, False]],  # 23 (P4/16-medium) #40×40×256

   [-1, 1, Conv, [512, 3, 2]], #20×20×512
   [[-1, 12], 1, Concat, [1]],  # cat head P5  #20×20×1024
   [-1, 3, C3, [1024, False]],  # 26 (P5/32-large) #20×20×512

   [[20, 23, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
