# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple
backbone1depth: 2  # layer channel multiple
anchors: 4
#  - [3,2,  3,2,  4,3]  # P3/8
#  - [5,3,  6,4,  7,5]  # P4/16
#  - [9,5,  11,6,  15,8]  # P5/32

#  - [ 7,7,  10,7,  10,9 ]  # P3/8
#  - [ 14,8,  12,11,  16,11 ]  # P4/16
#  - [ 15,14,  22,11,  26,15 ]  # P5/32

#  - [3,6, 8,14, 18,26]  #4

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  #0 -P1/2
   [-1, 3, C3, [8]], #1 640*640*8
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  #2 0-P1/2
   [-1, 3, C3, [8]], #3 640*640*8
   [[-1, 1], 1, Concat3, [16,1]],  #4 640*640*16
   [-1, 3, C3, [32]], #5 640*640*32

   [-1, 1, Conv, [64, 3, 2]],  #6 320*320*64
   [-1, 3, C3, [64]], #7 320*320*64

   [-1, 1, Conv, [128, 3, 2]], #8 160*160*128
   [-1, 3, C3, [128]], #9 160*160*128

   [ -1, 1, Conv, [256, 3, 2 ] ], #10 80*80*256
   [ -1, 3, C3, [256]], #11 80*80*256

   [-1, 1, Conv, [512, 3, 2]], #12 40*40*512
   [-1, 9, C3, [512]], #13 40*40*512
   [-1, 1, SPPF, [512, 5]],  #14 40*40*512
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]], #15 40*40*256
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #16 80*80*256
   [[-1, 11], 1, Concat, [1]],  #17 cat backbone P4 80*80*512
   [-1, 3, C3, [256, False]],  # 18 80*80*256

   [-1, 1, Conv, [128, 1, 1]],  #19 80*80*128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #20 160*160*128
   [[-1, 9], 1, Concat, [1]],  #21 cat backbone P3 160*160*256
   [-1, 3, C3, [128, False]],  # 22 160*160*128

   [-1, 1, Conv, [64, 1, 1]],  #23 160*160*64
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #24 320*320*64
   [[-1, 7], 1, Concat, [1]],  #25 cat backbone P2 320*320*128

   [-1, 3, C3, [64, False]],  # 26 320*320*64

   [ -1, 1, Conv, [64, 3, 2]],  # 27 160*160*64
   [ [ -1, 23], 1, Concat, [1]],  # 28 cat head P4 160*160*128
   [ -1, 3, C3, [128, False]],  # 29 160*160*128

   [-1, 1, Conv, [128, 3, 2]], #30 80*80*128
   [[-1, 19], 1, Concat, [1]],  #31 cat head P5 80*80*256
   [-1, 3, C3, [256, False]],  #32 (P5/32-large) 80*80*256

   [-1, 1, Conv, [256, 3, 2]], #33 40*40*256
   [[-1, 15], 1, Concat, [1]],  #34 cat head P5 40*40*512
   [ -1, 3, C3, [512, False]] ,  #35 (P5/32-large) 40*40*512

   [[26, 29, 32, 35], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
